# Updating DATA

In [5]:
USE birdwatchers;

In [6]:
DROP TABLE IF EXISTS humans;
CREATE TABLE humans (
  human_id int(11) NOT NULL AUTO_INCREMENT,
  formal_title enum('Mr','Ms') COLLATE latin1_bin DEFAULT NULL,
  name_first varchar(25) COLLATE latin1_bin DEFAULT NULL,
  name_last varchar(25) COLLATE latin1_bin DEFAULT NULL,
  email_address varchar(255) COLLATE latin1_bin DEFAULT NULL,
  street_address varchar(255) COLLATE latin1_bin DEFAULT NULL,
  city varchar(100) COLLATE latin1_bin DEFAULT NULL,
  state_province varchar(100) COLLATE latin1_bin DEFAULT NULL,
  postal_code varchar(10) COLLATE latin1_bin DEFAULT NULL,
  country_id char(2) COLLATE latin1_bin DEFAULT NULL,
  join_date date DEFAULT NULL,
  membership_type enum('basic','premium') COLLATE latin1_bin DEFAULT NULL,
  membership_expiration date DEFAULT NULL,
  better_birders_site tinyint(4) DEFAULT '0',
  possible_duplicate tinyint(4) DEFAULT '0',
  birding_background blob,
  skill_level enum('Backyard Birder','Street Noticer','Field Spotter','Expert') COLLATE latin1_bin DEFAULT NULL,
  PRIMARY KEY (human_id),
  UNIQUE KEY email_address (email_address),
  KEY human_names (name_last,name_first)
) ENGINE=MyISAM AUTO_INCREMENT=37 DEFAULT CHARSET=latin1 COLLATE=latin1_bin;

In [7]:
LOCK TABLES humans WRITE;
INSERT INTO humans VALUES (1,'Mr','Russell','Dyer','russell@mysqlresources.com',NULL,NULL,NULL,NULL,'uk','2013-10-01','premium','2013-09-22',0,1,NULL,'Street Noticer'),(2,'Mr','Richard','Stringer','richard@mysqlresources.com',NULL,NULL,NULL,NULL,'uk','2013-10-01','premium','2013-09-22',0,0,NULL,'Field Spotter'),(3,'Ms','Rusty','Osborne','rusty@mysqlresources.com',NULL,NULL,NULL,NULL,'ch','2013-10-01','premium','2013-12-22',0,0,NULL,'Street Noticer'),(4,'Ms','Lexi','Hollar','alexandra@mysqlresources.com',NULL,NULL,NULL,NULL,'uk','2013-10-01','premium','2013-09-22',0,0,NULL,'Backyard Birder'),(15,'Mr','Barry','Pilson','barry@gomail.com',NULL,NULL,NULL,NULL,NULL,'2013-10-01',NULL,NULL,0,0,NULL,'Expert'),(16,'Mr','Ricky','Adams','ricky@gomail.com',NULL,NULL,NULL,NULL,NULL,'2013-10-01',NULL,NULL,0,0,NULL,'Backyard Birder'),(17,'Mr','Rusell','Dyer','russell@dyerhouse.com',NULL,NULL,NULL,NULL,'us','2013-10-01','basic',NULL,0,1,NULL,'Field Spotter'),(25,'Ms','Elena','Bokova','elena.bokova@yahoo.com',NULL,NULL,NULL,NULL,'ru','2013-10-01','basic',NULL,0,1,NULL,'Backyard Birder'),(19,'Ms','Elena','Bokova','ebokova@gmail.com',NULL,NULL,NULL,NULL,'ru','2011-05-21','premium','2016-10-01',1,1,NULL,'Backyard Birder'),(26,'Ms','Katerina','Smirnova','katya@mail.ru',NULL,NULL,NULL,NULL,'ru','2012-02-01','basic',NULL,0,0,NULL,'Field Spotter'),(27,'Ms','Anahit','Vanetsyan','anahit@gmail.com',NULL,NULL,NULL,NULL,'ru','2011-10-01','basic',NULL,0,0,NULL,'Backyard Birder'),(28,'Ms','Marie','Dyer','marie@gmail.com',NULL,NULL,NULL,NULL,'us','2012-12-07','basic',NULL,0,0,NULL,'Expert'),(29,'Ms','Geoffrey','Dyer','',NULL,NULL,'Ocean Beach','NJ','us','2012-04-12','basic',NULL,0,0,NULL,'Backyard Birder'),(30,'Ms','MICHAEL','STONE',NULL,NULL,NULL,'San Diego','CA','us','2012-04-12','basic',NULL,0,0,NULL,'Backyard Birder'),(34,'Ms','Melissa','Lee',NULL,NULL,NULL,NULL,NULL,NULL,'2013-10-15',NULL,NULL,0,0,'\0\0\0xIK/É¨THJLN//K\0Z','Street Noticer'),(35,'Mr','andy','oram',NULL,NULL,'Cambridge','MA','02140','us','2013-10-16','basic',NULL,0,0,NULL,'Expert'),(36,'Mr','Michael','Zabalaoui',NULL,NULL,'New Orleans','LA','70130','us','2013-10-16','basic',NULL,0,0,NULL,'Street Noticer');
UNLOCK TABLES;

In [8]:
UPDATE birdwatchers.humans
SET country_id = 'us';

# Updating Specific Rows

In [9]:
SELECT human_id, name_first, name_last
FROM humans
WHERE name_first = 'Rusty'
AND name_last = 'Osborne';

human_id,name_first,name_last
3,Rusty,Osborne

In [10]:
UPDATE humans
SET name_last = 'Johnson'
WHERE human_id = 3;
SELECT human_id, name_first, name_last
FROM humans
WHERE human_id = 3;

human_id,name_first,name_last
3,Rusty,Johnson

In [11]:
UPDATE humans
SET formal_title = 'Ms.'
WHERE human_id IN(24, 32);

In [12]:
SHOW FULL COLUMNS
FROM humans
LIKE 'formal_title';

Field,Type,Collation,Null,Key,Default,Extra,Privileges,Comment
formal_title,"enum('Mr','Ms')",latin1_bin,YES,,NULL,,"select,insert,update,references",

In [13]:
UPDATE humans
SET formal_title = 'Ms.'
WHERE formal_title IN('Miss','Mrs.');

In [14]:
ALTER TABLE humans
CHANGE COLUMN formal_title formal_title ENUM('Mr.','Ms.');

Data truncated for column 'formal_title' at row 1
(B(B

In [15]:
SHOW WARNINGS;

Level,Code,Message
Error,1265,Data truncated for column 'formal_title' at row 1

In [16]:
ALTER TABLE humans
CHANGE COLUMN formal_title formal_title ENUM('Mr.','Ms.','Mr','Ms');
UPDATE humans
SET formal_title = SUBSTRING(formal_title, 1, 2);
ALTER TABLE humans
CHANGE COLUMN formal_title formal_title ENUM('Mr','Ms');

# Limiting Updates

In [17]:
CREATE TABLE prize_winners
(winner_id INT AUTO_INCREMENT PRIMARY KEY,
human_id INT,
winner_date DATE,
prize_chosen VARCHAR(255),
prize_sent DATE);

In [18]:
INSERT INTO prize_winners
(human_id)
SELECT human_id
FROM humans;

# Ordering to Make a Difference

In [20]:
UPDATE prize_winners
SET winner_date = CURDATE()
WHERE winner_date IS NULL
ORDER BY RAND()
LIMIT 2;

In [21]:
SHOW WARNINGS;

# Updating Multiple Tables

In [22]:
UPDATE prize_winners, humans
SET winner_date = NULL,
prize_chosen = NULL,
prize_sent = NULL
WHERE country_id = 'uk'
AND prize_winners.human_id = humans.human_id;

In [23]:
UPDATE prize_winners, humans
SET winner_date = CURDATE()
WHERE winner_date IS NULL
AND country_id = 'uk'
AND prize_winners.human_id = humans.human_id
ORDER BY RAND()
LIMIT 2;

In [24]:
UPDATE prize_winners
SET winner_date = CURDATE()
WHERE winner_date IS NULL
AND human_id IN
(SELECT human_id
FROM humans
WHERE country_id = 'uk'
ORDER BY RAND())
LIMIT 2;

# Handling Duplicates

In [25]:
ALTER TABLE humans
ADD COLUMN better_birders_site TINYINT DEFAULT 0;

Duplicate column name 'better_birders_site'
(B(B

In [26]:
INSERT INTO humans
(formal_title, name_first, name_last, email_address, better_birders_site)
VALUES('Mr','Barry','Pilson', 'barry@gomail.com', 1),
('Ms','Lexi','Hollar', 'alexandra@mysqlresources.com', 1),
('Mr','Ricky','Adams', 'ricky@gomail.com', 1)
ON DUPLICATE KEY
UPDATE better_birders_site = 2;

In [27]:
INSERT INTO prize_winners
(human_id)
SELECT human_id
FROM humans
WHERE better_birders_site = 1;

In [28]:
ALTER TABLE humans
ADD COLUMN possible_duplicate TINYINT DEFAULT 0;
CREATE TEMPORARY TABLE possible_duplicates
(name_1 varchar(25), name_2 varchar(25));

Duplicate column name 'possible_duplicate'
(B(B

In [29]:
INSERT INTO possible_duplicates
SELECT name_first, name_last
FROM
(SELECT name_first, name_last, COUNT(*) AS nbr_entries
FROM humans
GROUP BY name_first, name_last) AS derived_table
WHERE nbr_entries > 1;

In [31]:
UPDATE humans, possible_duplicates
SET possible_duplicate = 1
WHERE name_first = name_1
AND name_last = name_2;

# Deleting Data

In [32]:
DELETE FROM humans
WHERE name_first = 'Elena'
AND name_last = 'Bokova'
AND email_address LIKE '%yahoo.com';

# Deleting in Multiple Tables

In [33]:
DELETE FROM humans, prize_winners
USING humans JOIN prize_winners
WHERE name_first = 'Elena'
AND name_last = 'Bokova'
AND email_address LIKE '%yahoo.com'
AND humans.human_id = prize_winners.human_id;